<?php
namespace kst;

class KsuCode{
    const FACULTY_DEPT =[  //学科のIDと名称
        'RS'=>'理工学部 情報科学科',
        'RM'=>'理工学部 機械工学科',
        'RE'=>'理工学部 電気工学科',        
        'LL'=>'生命科学部 生命科学科',        
        'UA'=>'建築都市工学部 建築学科',
        'UH'=>'建築都市工学部 住居・インテリア学科',
        'UC'=>'建築都市工学部 都市デザイン工学科',
        'CB'=>'商学部 経営・流通学科',
        'EE'=>'経済学部 経済学科',        
        'DT'=>'地域共創学部 観光学科',
        'DR'=>'地域共創学部 地域づくり学科',
        'AA'=>'芸術学部 芸術表現学科',
        'AP'=>'芸術学部 写真・映像メディア学科',
        'AD'=>'芸術学部 ビジュアルデザイン学科',
        'AE'=>'芸術学部 生活環境デザイン学科',
        'AS'=>'芸術学部 ソーシャルデザイン学科',        
        'KK'=>'国際文化学部 国際文化学科',
        'KN'=>'国際文化学部 日本文化学科',        
        'HP'=>'人間科学部 臨床心理学科',
        'HC'=>'人間科学部 子ども教育学科',
        'HS'=>'人間科学部 スポーツ学科',
    ];

    const GRADUATE_SCHL = [ //大学院のIDと名称  
        'GBE'=>'経済・ビジネス研究科 経済学専攻',
        'GBM'=>'経済・ビジネス研究科 現代ビジネス専攻',
        'GTI'=>'工学研究科 産業技術デザイン',
        'GJK'=>'情報科学研究科 情報科学専攻',
        'GAC'=>'芸術研究科 造形表現専攻',
        'GKK'=>'国際文化研究科 国際文化専攻',

        'DBE'=>'経済・ビジネス研究科 経済学専攻',
        'DBM'=>'経済・ビジネス研究科 現代ビジネス専攻',
        'DTI'=>'工学研究科 産業技術デザイン専攻',
        'DJK'=>'情報科学研究科 情報科学専攻',
        'DAC'=>'芸術研究科 造形表現専攻',
        'DKK'=>'国際文化研究科 国際文化専攻',
    ];
}